app/controllers/posts_controller.rb

  def new
    #@post = Post.new
    #@post = Post.new(author_id: params[:author_id])
    if params[:author_id] && !Author.exists?(params[:author_id])
---
SELECT  1 AS one FROM "authors" LIMIT 1
SELECT "authors".* FROM "authors"

  def edit
    #@post = Post.find(params[:id])
    if params[:author_id]
      author = Author.find_by(id: params[:author_id]) #find_by is used to iterate through the collection of posts that are by that author!! not just searching for that author id. Need to be that author id and be associated with those posts.
      if author.nil? #if no author
        redirect_to authors_path, alert: "Author not found." #flash message
      else
        @post = author.posts.find_by(id: params[:id])
---
SELECT  "authors".* FROM "authors" WHERE "authors"."id" = ? LIMIT 1  [["id", 123456]]
SELECT  "posts".* FROM "posts" WHERE "posts"."author_id" = ? AND "posts"."id" = ? LIMIT 1  [["author_id", 1], ["id", 1]]